// Задача 19: Напишите программу, которая принимает 
// на вход пятизначное число и проверяет, является ли 
// оно палиндромом.

System.Console.WriteLine("Введите пятизначное число");
int n = Convert.ToInt32(Console.ReadLine());
int [] numbers = {n};
